/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   cwd.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jerrok <jerrok@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/25 01:02:37 by iidkhebb          #+#    #+#             */
/*   Updated: 2022/04/28 15:24:40 by jerrok           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

int	__cwd__(void)
{
	char	*cwd;
/*
При вызове функции getcwd() с параметром dir, равным NULL, функция getcwd() 
автоматичес­ки размещает буфер с использованием функции malloc() и 
возвращает указатель на этот буфер
*/
	cwd = getcwd(NULL, 0);
	if (!cwd)
	{
		chdir("..");
		cwd = getcwd(NULL, 0);
	}
	ft_putendl_fd(cwd, STDOUT_FILENO);
	free(cwd);
	return (0);
}
